1.
//Связанные списки
//return maxlength / 2; 
//не известно, что будет при 
//делении нечётного числа.
//Можно округлять в нужную сторону
//или применить целочисленное деление

2.
//Связанные списки, переменные для статуса операции
//head_mark != -1 && head_mark == cursor
//можно выделить отдельную переменную типа boolean

3.
//Код из JavaScript
//elementsToAdd = companySize / sliderValue
//в переменной elementsToAdd по идее всегда будет 
// целочисленное значение, но для перестраховки
//лучше добавить округление в большую или меньшую сторону

4. 
//Код из JavaScript
//в поиске элемент
//if (Strint(space[(index + step * i) % length]) == String(value))
//выражение Strint(space[(index + step * i) % length]нужно вынести в отдельную переменную
