
processing_document - create_and_save_document
//функция создавала и сохраняла документ
//в изначальном названии было не совсем понятно
//что в ней происходит

distance_calculation - calc_distance
//сократил название и переставил слова местами
//чтобы было более понятно

date - check_current_date
//функция вычисляет текущую дату
//в изначальном варианте сразу не ясно что в ней происходит

find_button - find_active_btn
//функция из кода на JS
//находит на странице одну активную кнопку
//по идее на данном этапе проблемы не возникнет
//так как сам функционал не большой
//но в будущем, к примеру если будет необходимость
//отслеживать другие кнопки, могла возникнуть путаница

check_width - check_screen_width
//функция из кода на JS
//отслеживает ширину экрана
//теперь стало понятно, что ширина именно экрана
//а не какого-то любого элемента на веб-странице

change_text - change_btn_text_on_hover
//функция из кода на JS
//заменяет текст кнопки при наведении
//до изменения названия было не понятно
//какой текст, где и почему меняется

add_class - add_class_to_active_btn
//функция из кода на JS
//добавляет новый CSS класс к активной кнопке
//до изменения названия было не понятно
//куда и почему добавляется класс

remove_class - remove_class_from_nonactive_btn
//функция из кода на JS
//убирает класс у не активной кнопки
//до изменения названия было не понятно
//откуда и почему удаляется класс

change_transition - decrease_animation_transition
//функция из кода на JS
//уменьшает плавность анимации
//до изменения названия было не понятно
//как и у чего изменяется плавность анимации

close_menu - hide_menu_on_mobile_devices
//функция из кода на JS
//при определенных условиях скрывает меню
//до изменения названия было не понятно
//что и при каких условиях происходит

send_form - validate_and_send_form_data
//функция из кода на JS
//функция производит первичную валидацию
//данных введенных в форму и отправляет их


