7.1
buttonDosentExist - is_button_found
//переменная из кода на JS
//пердназначена для определения 
//найдена ли нужная кнопка на странице
//после переименования имя стало короче 
//и более понятно


flag - is_send_results
//использовал переменную с названием
//flag, так как думал что это будет хорошо
//после изучения вашего занятия, понял
//что это очень неоднозначное название
//теперь название более конкретно передает
//что происходит, если в ней значение true/false


foundedNumber - is_number_found
//булевая переменная по которой 
//определяется найдено ли нужное число
//изначально название не передавало
//однозначное значение true или false
//из названия больше то, что в нем 
//хранится найденное число
